docs/initial_exploration_and_extraction.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-11-29 Fri 14:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Initial Data Exploration and Data Extraction</title>
<meta name="author" content="Sam Neaves" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/hideshow.css"/>
<link rel="stylesheet" type="text/css" href="styles.css">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="overview.html"> UP </a>
 |
 <a accesskey="H" href=""> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Initial Data Exploration and Data Extraction</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb1e47b7">1. About</a></li>
<li><a href="#orge48499d">2. Data info</a>
<ul>
<li><a href="#org77f7547">2.1. Get the normalised expression values</a></li>
<li><a href="#org7c79a63">2.2. Get the count expression values</a></li>
</ul>
</li>
<li><a href="#org822a6b9">3. Finding the overlap</a></li>
<li><a href="#org95f6fbc">4. Complexes</a></li>
<li><a href="#org3fadd46">5. Edge types</a></li>
<li><a href="#org545df26">6. Select cells and genes</a></li>
</ul>
</div>
</div>
<div id="navigation"> <div id="mytitle"><h1>ParkinsonPathAI (Working title) - AI Models for Pathway Analysis in Parkinson’s Disease</h1></div>
<ul class="org-ul">
<li><a href="overview.html">Overview</a></li>
<li><a href="get_prior_knowledge_network.html">Get prior knowledge network</a></li>
<li><a href="initial_exploration_and_extraction.html">Initial Data Exploration and Data Extraction</a></li>
<li><a href="cell_state_subgroup_discover.html">Cell State Subgroup Discovery</a></li>
<li><a href="cell_state_subgroup_discover.html">Cell State Subgroup Discovery2</a></li>
</ul>
</div>

<div id="outline-container-orgb1e47b7" class="outline-2">
<h2 id="orgb1e47b7"><span class="section-number-2">1.</span> About</h2>
<div class="outline-text-2" id="text-1">
<p>
This work is a part of the <a href="../readme.html">ParkinsonPathAI</a> project. The code described
here is part 2 of the work.
</p>
</div>
</div>


<div id="outline-container-orge48499d" class="outline-2">
<h2 id="orge48499d"><span class="section-number-2">2.</span> Data info</h2>
<div class="outline-text-2" id="text-2">
<p>
"Just sending the single nuclei data for the dopaminergic neurons in our atlas as Caleb suggested.
The file “SNatlas_DaNs_seurat.RData” is in the usual Dropbox folder.
The Seurat object in it is called “sn_atlas_dans” and contains all
neurons across all disease stages and subtypes. You can access disease
by sn_atlas_dans$Disease and cell subtype by
sn_atlas_dans$CellSubType. And extract gene expression data as raw
counts genes_counts&lt;-as.matrix(GetAssayData(sn_atlas_dans, slot =
"counts")) or normalised
genes_norm&lt;-as.matrix(GetAssayData(sn_atlas_dans, slot = "data"))."
</p>



<div class="org-src-container">
<pre class="src src-R"><span style="color: #008b8b;">library</span>(dplyr)
<span style="color: #008b8b;">library</span>(Seurat)
<span style="color: #008b8b;">library</span>(patchwork)

data_location <span style="color: #008b8b;">&lt;-</span> <span style="color: #8b2252;">"/Users/samneaves/Documents/test_data/forSam/SNatlas_DaNs_seurat.RData"</span>
<span style="color: #008b8b;">load</span>(data_location)

</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">head(sn_atlas_dans$CellSubType)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">DaN_0</td>
</tr>

<tr>
<td class="org-left">DaN_0</td>
</tr>

<tr>
<td class="org-left">DaN_1</td>
</tr>

<tr>
<td class="org-left">DaN_1</td>
</tr>

<tr>
<td class="org-left">DaN_0</td>
</tr>

<tr>
<td class="org-left">DaN_0</td>
</tr>
</tbody>
</table>
</div>



<div id="outline-container-org77f7547" class="outline-3">
<h3 id="org77f7547"><span class="section-number-3">2.1.</span> Get the normalised expression values</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-R">genes_norm<span style="color: #008b8b;">&lt;-</span>as.matrix(GetAssayData(sn_atlas_dans, slot = <span style="color: #8b2252;">"data"</span>))
</pre>
</div>
</div>
</div>


<div id="outline-container-org7c79a63" class="outline-3">
<h3 id="org7c79a63"><span class="section-number-3">2.2.</span> Get the count expression values</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-R">genes_counts<span style="color: #008b8b;">&lt;-</span>as.matrix(GetAssayData(sn_atlas_dans, slot = <span style="color: #8b2252;">"counts"</span>))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org822a6b9" class="outline-2">
<h2 id="org822a6b9"><span class="section-number-2">3.</span> Finding the overlap</h2>
<div class="outline-text-2" id="text-3">
<p>
Find the overlap of list of genes that we get back from pathway commons and our data
</p>
<div class="org-src-container">
<pre class="src src-R">network_data <span style="color: #008b8b;">&lt;-</span> read.table(<span style="color: #8b2252;">"../../data/pybravo_output/expanded_reg_md10-unified.sif"</span>, quote = <span style="color: #8b2252;">""</span>, header = <span style="color: #228b22;">FALSE</span>, stringsAsFactors = <span style="color: #228b22;">FALSE</span>, sep = <span style="color: #8b2252;">"\t"</span>)
head(network_data)
nodes <span style="color: #008b8b;">&lt;-</span> unique(c(network_data$V1, network_data$V3))
</pre>
</div>

<pre class="example">
        V1         V2     V3
1 Fra1/JUN ACTIVATION   CCL2
2 Fra1/JUN ACTIVATION   Fra1
3 Fra1/JUN ACTIVATION    IL6
4 Fra1/JUN ACTIVATION p14ARF
5 Fra1/JUN ACTIVATION   MMP9
6 Fra1/JUN ACTIVATION  CXCL8
</pre>



<div class="org-src-container">
<pre class="src src-R">length(nodes)
</pre>
</div>

<pre class="example">
[1] 1053
</pre>


<div class="org-src-container">
<pre class="src src-R"><span style="color: #b22222;"># </span><span style="color: #b22222;">Convert the rownames of genes_counts into a vector</span>
genes_names <span style="color: #008b8b;">&lt;-</span> rownames(genes_counts)

<span style="color: #b22222;"># </span><span style="color: #b22222;">Get the intersection between the 'name' column in node_table and the rownames of genes_counts_subset_df</span>
common_names <span style="color: #008b8b;">&lt;-</span> intersect(nodes, genes_names)

<span style="color: #b22222;"># </span><span style="color: #b22222;">View the result</span>
length(common_names)
</pre>
</div>

<pre class="example">
[1] 526
</pre>
</div>
</div>

<div id="outline-container-org95f6fbc" class="outline-2">
<h2 id="org95f6fbc"><span class="section-number-2">4.</span> Complexes</h2>
<div class="outline-text-2" id="text-4">
<p>
In the graph representation we have genes and protein complexes.
A protein complex node is represented by Item/Item. For example
</p>

<p>
SMAD3/SMAD4/JUN/FOS
</p>

<p>
When we match our gene expression data to the network. These nodes
will be unobserved. We will need to infer if they are able to
form/activate.
</p>

<p>
In the way that the pybravo paper describes these nodes are used in
there iggy analysis. The 'part_of' edge is treated as plus. But I think the standard consistency
check is only looking for at least one positive edge to label a node
as consistant So not sure if that is appropiate. (will add detail to
this point later).
</p>

<p>
For the time being the number of complexes seem to be :
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #b22222;"># </span><span style="color: #b22222;">Identify rows in the 'name' column that contain '/'</span>
complexes <span style="color: #008b8b;">&lt;-</span> grep(<span style="color: #8b2252;">"/"</span>, nodes)

<span style="color: #b22222;"># </span><span style="color: #b22222;">Count the number of complexes</span>
num_complexes <span style="color: #008b8b;">&lt;-</span> length(complexes)

<span style="color: #b22222;"># </span><span style="color: #b22222;">View the count</span>
num_complexes
</pre>
</div>

<pre class="example">
[1] 296
</pre>
</div>
</div>
