scripts/r/init_data_explore_extract.r

# View the count
num_complexes
## Complexes:1 ends here

## [[file:../org/initial_exploration_and_extraction.org::*Edge types][Edge types:1]]
# Count occurrences of each edge type in the second column (V2)
edge_counts <- table(network_data$V2)

# Display the counts of each edge type
print(edge_counts)
## Edge types:1 ends here

## [[file:../org/initial_exploration_and_extraction.org::*Edge types][Edge types:2]]
str(sn_atlas_dans)
summary(sn_atlas_dans)
