docs/initial_exploration_and_extraction.html
<div id="outline-container-org545df26" class="outline-2">
<h2 id="org545df26"><span class="section-number-2">6.</span> Select cells and genes</h2>
<div class="outline-text-2" id="text-6">
<p>
We want to select Cells that are either control or parkinsons
We want to only select the genes that are in our network.
</p>
<div class="org-src-container">
<pre class="src src-R">sn_atlas_dans_ctrl_vs_pd <span style="color: #008b8b;">&lt;-</span> subset(sn_atlas_dans, subset = Disease <span style="color: #008b8b;">%in%</span> c(<span style="color: #8b2252;">"CTR"</span>, <span style="color: #8b2252;">"PD_B5-6"</span>, <span style="color: #8b2252;">"PD_B3-4"</span>))
sn_atlas_dans_ctrl_vs_pd_pathway <span style="color: #008b8b;">&lt;-</span> sn_atlas_dans_ctrl_vs_pd[common_names,]
dim(sn_atlas_dans_ctrl_vs_pd_pathway)


</pre>
</div>

<pre class="example">
[1]  526 6385
</pre>


<div class="org-src-container">
<pre class="src src-R">
<span style="color: #b22222;"># </span><span style="color: #b22222;">Extract the expression matrix for the subset</span>
expression_matrix <span style="color: #008b8b;">&lt;-</span> as.data.frame(t(as.matrix(sn_atlas_dans_ctrl_vs_pd_pathway@assays$RNA@data)))

<span style="color: #b22222;"># </span><span style="color: #b22222;">Add Disease column from metadata</span>
expression_matrix$Disease <span style="color: #008b8b;">&lt;-</span> sn_atlas_dans_ctrl_vs_pd_pathway@meta.data$Disease

<span style="color: #b22222;"># </span><span style="color: #b22222;">Save to CSV</span>
write.csv(expression_matrix, file = <span style="color: #8b2252;">"../../data/cell_expression_with_disease.csv"</span>, row.names = <span style="color: #228b22;">TRUE</span>)


</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">
<span style="color: #b22222;"># </span><span style="color: #b22222;">Extract the count matrix for the subset and transpose it for cells as rows</span>
count_matrix <span style="color: #008b8b;">&lt;-</span> as.data.frame(t(as.matrix(sn_atlas_dans_ctrl_vs_pd_pathway@assays$RNA@counts)))

<span style="color: #b22222;"># </span><span style="color: #b22222;">Add Disease column from metadata</span>
count_matrix$Disease <span style="color: #008b8b;">&lt;-</span> sn_atlas_dans_ctrl_vs_pd_pathway@meta.data$Disease

<span style="color: #b22222;"># </span><span style="color: #b22222;">Save to CSV</span>
write.csv(count_matrix, file = <span style="color: #8b2252;">"../../data/cell_count_with_disease.csv"</span>, row.names = <span style="color: #228b22;">TRUE</span>)

</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Sam Neaves</p>
<p class="date">Created: 2024-11-29 Fri 14:14</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
