scripts/r/init_data_explore_extract.r
## Edge types:2 ends here

## [[file:../org/initial_exploration_and_extraction.org::*Select cells and genes][Select cells and genes:1]]
sn_atlas_dans_ctrl_vs_pd <- subset(sn_atlas_dans, subset = Disease %in% c("CTR", "PD_B5-6", "PD_B3-4"))
sn_atlas_dans_ctrl_vs_pd_pathway <- sn_atlas_dans_ctrl_vs_pd[common_names,]
dim(sn_atlas_dans_ctrl_vs_pd_pathway)
## Select cells and genes:1 ends here

## [[file:../org/initial_exploration_and_extraction.org::*Select cells and genes][Select cells and genes:2]]
# Extract the expression matrix for the subset
expression_matrix <- as.data.frame(t(as.matrix(sn_atlas_dans_ctrl_vs_pd_pathway@assays$RNA@data)))

# Add Disease column from metadata
expression_matrix$Disease <- sn_atlas_dans_ctrl_vs_pd_pathway@meta.data$Disease

# Save to CSV
write.csv(expression_matrix, file = "../../data/cell_expression_with_disease.csv", row.names = TRUE)
## Select cells and genes:2 ends here

## [[file:../org/initial_exploration_and_extraction.org::*Select cells and genes][Select cells and genes:3]]
# Extract the count matrix for the subset and transpose it for cells as rows
count_matrix <- as.data.frame(t(as.matrix(sn_atlas_dans_ctrl_vs_pd_pathway@assays$RNA@counts)))

# Add Disease column from metadata
count_matrix$Disease <- sn_atlas_dans_ctrl_vs_pd_pathway@meta.data$Disease

# Save to CSV
write.csv(count_matrix, file = "../../data/cell_count_with_disease.csv", row.names = TRUE)
## Select cells and genes:3 ends here
